#include <iostream>
using namespace std;
int main() {
    int player, arr[2][10][10], q0 = 0, q1 = 0, x, y, sum0 = 0, sum1 = 0, k;
    cout << "⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣴⠾⠿⣶⣄⠄⠄⠄⠄⠄⠄⠄⠄⠄" << endl << "⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿⡇⠄⠄⠈⣿⠄⠄⠄⠄⠄⠄⠄⠄⠄" << endl 
    	 << "⠄⠄⠄⠄⠄⠄⠄⠄⠄⠙⣷⣤⣤⣾⠟⠄⠄⠄⠄⠄⠄⠄⠄⠄" << endl << "⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿⣿⡇⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄" << endl 
    	 << "⠄⠄⠄⠄⠄⠈⠉⠉⠉⠉⢹⣿⣿⡏⠉⠉⠉⠉⠁⠄⠄⠄⠄⠄" << endl << "⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢸⣿⣿⡇⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄" << endl 
    	 << "⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢸⣿⣿⡇⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄" << endl << "⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢸⣿⣿⡇⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄" << endl 
    	 << "⠄⢠⣧⠄⠄⠄⠄⠄⠄⠄⢸⣿⣿⡇⠄⠄⠄⠄⠄⠄⠄⢠⣷⡀" << endl << "⢠⣿⣿⣧⠄⠄⠄⠄⠄⠄⢸⣿⣿⡇⠄⠄⠄⠄⠄⠄⣠⣿⣿⣇" << endl 
    	 << "⣸⢿⣿⣏⠁⠄⠄⠄⠄⠄⣼⣿⣿⣧⠄⠄⠄⠄⠄⠘⢻⣿⡿⣿" << endl << "⠄⠄⢻⣿⣦⣀⠄⠄⢀⣰⣿⣿⣿⣿⣄⠄⠄⠄⢀⣴⣿⣿⠄⠄" << endl 
    	 << "⠄⠄⠄⠹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠁⠄⠄" << endl << "⠄⠄⠄⠄⠄⠙⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠋⠄⠄⠄⠄" << endl 
    	 << "⠄⠄⠄⠄⠄⠄⠄⠄⠉⠙⠿⣿⣿⡿⠟⠉⠁⠄⠄⠄⠄⠄⠄⠄" << endl << "⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠙⠟⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄";

	cout << endl << endl << "С кем вы хотите играть? С человеком (1) или машиной (2)?" << endl;
	cin >> player;
	if(player == 1){
		system("clear");
		for (int h = 0; h < 2; h++){
			if (h == 0){
				cout << "Корабли расставляет первый игрок:" << endl;
				for (int i = 0; i < 10; i++){
					for (int j = 0; j < 10; j++){
						cin >> arr[h][i][j];
						if ((h == 0) && (arr[h][i][j] == 1)) q0++;
						if ((h == 1) && (arr[h][i][j] == 1)) q1++;
					}
				}
				if (q0 != 18){
					do{
						q0 = 0;
				    	cout << endl << endl << "Вы поставили не всё или ваши корабли пересекаются, попробуйте еще:" << "     " << h << endl;
				    	for (int i = 0; i < 10; i++){
				       		for (int j = 0; j < 10; j++){
					        	cin >> arr[h][i][j];
					        	if (arr[h][i][j] == 1) q0++;
				        	}
			        	}
				 	}while (q0 != 18);
				}
			}
		
			if (h ==1){
				system("clear");
				cout << "Корабли расставляет второй игрок:" << endl;
				for (int i = 0; i < 10; i++){
					for (int j = 0; j < 10; j++){
						cin >> arr[h][i][j];
						if ((h == 1) && (arr[h][i][j] == 1)) q1++;
					}
				}
				if (q1 != 18){
					do{
						q1 = 0;
				    	cout << endl << endl << "Вы поставили не всё или ваши корабли пересекаются, попробуйте еще:" << "     " << h << endl;
				    	for (int i = 0; i < 10; i++){
				        	for (int j = 0; j < 10; j++){
					        	cin >> arr[h][i][j];
					        	if ((h == 1) && (arr[h][i][j] == 1)) q1++;
			        		}
						}   
					} while (q1 != 18);
				}
			}
		}
		do {
///////////////////////   первый   ////////////////////////////////////////////////
            system("clear");
            int we = 0;
			do {
				for (int i = -1; i < 10; i++) {
          			if (i == -1)
            			cout << "";
          			else
            			cout << i;
          			for (int j = -1; j < 10; j++) {
            			if (i == -1) {
              				if (j != -1) {
                				cout << j << " ";
              				} else
                				cout << "  ";
            			}
            			if ((i != -1) && (j != -1)) {
              				if ((arr[1][i][j] == 0) || (arr[1][i][j] == 1))
                				cout << "  ";
              				if (arr[1][i][j] == 2) cout << " +";
              				if (arr[1][i][j] == 3) cout << " .";
            			}
          			}
          			cout << endl;
        		}

				cout << "Ход первого: " << endl;
				cin >> x >> y; // x - столбик, y - строчка
				system("clear");
				if ((arr[1][y][x] == 2) || (arr[1][y][x] == 3))
					cout << "Вы уже ходили по этим координатам, приудмайте другие ;-)" << endl;   
				k = 10;
				if (arr[1][y][x] == 0){ 	
					arr[1][y][x] = 3;
					we = 1;
				}
				if (arr[1][y][x] == 1){
					q1--;
					sum0+=k;
					k+=5;
					arr[1][y][x] = 2;
					if (x == 0){
						if ((y == 0) && (arr[1][y][x + 1] == 0 || arr[1][y][x + 1] == 3) && (arr[1][y + 1][x + 1] == 3 || arr[1][y + 1][x + 1] == 0) && (arr[1][y + 1][x] == 3 || arr[1][y + 1][x] == 0)){
							cout << "Убит однопалубник1" << endl;
							arr[1][y][x + 1] = 3;		// право
							arr[1][y + 1][x + 1] = 3;	// низ право
							arr[1][y + 1][x] = 3; 		// низ
						
						}
						if ((y == 9) && (arr[1][y - 1][x] == 3 || arr[1][y - 1][x] == 0) && (arr[1][y - 1][x + 1] == 3 || arr[1][y - 1][x + 1] == 0) && (arr[1][y][x + 1] == 3 || arr[1][y][x + 1] == 0)){
							cout << "Убит однопалубник2" << endl;
							arr[1][y - 1][x] = 3;		// вверх 								
							arr[1][y - 1][x + 1] = 3; 	// вверх право
							arr[1][y][x + 1] = 3;		// право
	
						}
						if ((y != 0 && y != 9) && (arr[1][y - 1][x] == 3 || arr[1][y - 1][x] == 0) && (arr[1][y - 1][x + 1] == 3 || arr[1][y - 1][x + 1] == 0) && (arr[1][y][x + 1] == 3 || arr[1][y][x + 1] == 0) && (arr[1][y + 1][x + 1] == 3 || arr[1][y + 1][x + 1] == 0) && (arr[1][y + 1][x] == 3 || arr[1][y + 1][x] == 0)){
							cout << "Убит однопалубник3" << endl;
							arr[1][y - 1][x] = 3;		// вверх
							arr[1][y - 1][x + 1] = 3; 	// вверх право
							arr[1][y][x + 1] = 3;		// право
							arr[1][y + 1][x + 1] = 3;	// низ право
							arr[1][y + 1][x] = 3; 		// низ
						}
					}
					if (x == 9){
						if ((y != 0 && y != 9) && (arr[1][y - 1][x] == 3 || arr[1][y - 1][x] == 0) && (arr[1][y - 1][x - 1] == 3 || arr[1][y - 1][x - 1] == 0) && (arr[1][y][x - 1] == 3 || arr[1][y][x - 1] == 0) && (arr[1][y + 1][x] == 3 || arr[1][y + 1][x] == 0) && (arr[1][y + 1][x - 1] == 3 || arr[1][y + 1][x - 1] == 0)){
							cout << "убит однопалубник4" << endl;
							arr[1][y - 1][x] = 3;		// вверх
							arr[1][y - 1][x - 1] = 3;	//вверх лево
							arr[1][y][x - 1] = 3;		// лево
							arr[1][y + 1][x] = 3; 		// низ
							arr[1][y + 1][x - 1] = 3;	//низ лево			
						}else if ((y == 0) && (arr[1][y + 1][x] == 3 || arr[1][y + 1][x] == 0) && (arr[1][y + 1][x - 1] == 3 || arr[1][y + 1][x - 1] == 0) && (arr[1][y][x - 1] == 3 || arr[1][y][x - 1] == 0)){
							cout << "убит однопалубник5" << endl;
							arr[1][y + 1][x] = 3; 		// низ
							arr[1][y + 1][x - 1] = 3;	//низ лево						
							arr[1][y][x - 1] = 3;		// лево
						}else if ((y == 9) && (arr[1][y - 1][x] == 3 || arr[1][y - 1][x] == 0) && (arr[1][y][x - 1] == 3 || arr[1][y][x - 1] == 0) && (arr[1][y - 1][x - 1] == 3 || arr[1][y - 1][x - 1] == 0)){
							cout << "убит однопалубник6"<< endl;
							arr[1][y - 1][x] = 3;		// вверх
							arr[1][y][x - 1] = 3;		// лево
							arr[1][y - 1][x - 1] = 3;	//вверх лево
						}
					}
					if (x != 0 && x != 9 && (arr[1][y + 1][x] == 0 || (arr[1][y + 1][x] == 3)) && (arr[1][y - 1][x] == 0 || arr[1][y - 1][x] == 3) && (arr[1][y][x + 1] == 0 || arr[1][y][x + 1] == 3) && (arr[1][y][x - 1] == 0 || arr[1][y][x - 1] == 3)){
						cout << "убит однопалубник7" << endl;							
						arr[1][y - 1][x] = 3;		// вверх
						arr[1][y - 1][x + 1] = 3; 	// вверх право
						arr[1][y][x + 1] = 3;		// право
						arr[1][y + 1][x + 1] = 3;	// низ право
						arr[1][y + 1][x] = 3; 		// низ
						arr[1][y + 1][x - 1] = 3;	//низ лево						
						arr[1][y][x - 1] = 3;		// лево
						arr[1][y - 1][x - 1] = 3;	//вверх лево
					}
					
				}
			}while (we != 1);

///////////////////////   второй   ////////////////////////////////////////////////
				do {
					system("clear");
					for (int i = -1; i < 10; i++) {
          				if (i == -1)
            				cout << "";
          				else
            				cout << i;
          				for (int j = -1; j < 10; j++) {
            				if (i == -1) {
              					if (j != -1) {
                					cout << j << " ";
              					} else
                					cout << "  ";
            				}
            				if ((i != -1) && (j != -1)) {
              					if ((arr[0][i][j] == 0) || (arr[0][i][j] == 1))
                					cout << "  ";
              					if (arr[0][i][j] == 2) cout << " +";
              					if (arr[0][i][j] == 3) cout << " .";
            				}
          				}
          				cout << endl;
        			}

					cout <<"Ход второго: " << endl;
					cin >> x >> y; // x - столбик, y - строчка
					if (arr[0][y][x] == 2){
					 cout << "Вы уже ходили по этим координатам, приудмайте другие ;-)" << endl;   
					}
					if (arr[0][y][x] == 0) arr[0][y][x] = 3;
					if (arr[0][y][x] == 1){
						cout << "Подбит"<< endl;
						q0--;
						sum1+=k;
						arr[0][y][x] = 2;
					}
				}while (arr[0][y][x] != 3);	
			}while((q0 != 0) || (q1 != 0));
		}

	if (player == 2){
		cout << "Выберите уровень сложности компьютера:" << endl;
		cout << "1 — легкий, бьет в случайную клетку" << endl; 
		cout << "2 — нормальный, после попадания бьет в соседнюю точку по горизонтали или вертикали" << endl;
		cout << "3 — cложный, добивает без промахов корабль, в который попал" << endl;
		cin >> player;
		if (player == 3){
			cout << "Удачи.";
		}

	}
	return 0;
}
